//
//  JapaneseStock20170121.swift
//  MonkeyPortfolio
//
//  Created by 岡大輔 on 2017/01/21.
//  Copyright © 2017年 岡大輔. All rights reserved.
//

import UIKit

class JapaneseStock20170121: NSObject {
    
    
    func returnStockArray()->Array<String>
    {
        var stockArray = Array<String>();
        
        var anArray = ["極洋","日本水産","マルハニチロ","ホウスイ","カネコ種苗","サカタのタネ","ホクト","秋川牧園","アクシーズ","ホーブ","ベルグアース",
                     "ホクリヨウ","ルーデン・ホールディングス","エムビーエス","ウエストホールディングス","サムシングホールディングス","桧家ホールディングス",
                     "ショーボンドホールディングス","ミライト・ホールディングス","インターライフホールディングス","タマホーム","サンヨーホームズ",
                     "日本アクア","ファーストコーポレーション","エスケーホーム","ベステラ","JESCOホールディングス","インベスターズクラウド","フィット",
                     "岐阜造園","中外鉱業","住石ホールディングス","日鉄鉱業","三井松島産業","国際石油開発帝石","日本海洋掘削","石油資源開発","K＆Oエナジーグループ",
                     "省電舎","ダイセキ環境ソリューション","第一カッター興業","明豊ファシリティワークス","美樹工業","安藤・間","東急建設","コムシスホールディングス","ミサワホーム","日本電技",
                     "シンクレイヤ","ビーアールホールディングス","ミサワホーム中国","麻生フオームクリート","北弘電社","オーテック","三井金属エンジニアリング","NITTOH","シード平和",
                     "コーアツ工業","クレアホールディングス","太洋基礎工業","高松コンストラクショングループ","工藤建設","東建コーポレーション","ソネック","藤田エンジニアリング","日本乾溜工業",
                     "ワイ・ティー・エル・コーポレーション・バーハッド","富士古河E＆C","三井住建道路","川崎設備工業","ヤマウラ","常磐開発","アジアゲートホールディングス","ナカボーテック","三東工業社",
                     "山加電業","大本組","マサル","守谷商会","第一建設工業","大成建設","大林組","清水建設","飛島建設","佐藤渡辺","長谷工コーポレーション","松井建設","錢高組","鹿島建設","不動テトラ",
                     "大末建設","鉄建建設","西松建設","三井住友建設","大豊建設","前田建設工業","佐田建設","ナカノフドー建設","田辺工業","北海電気工事","奥村組","東鉄工業","土屋ホールディングス",
                     "サンユー建設","大盛工業","鈴縫工業","イチケン","富士ピー・エス","南海辰村建設","淺沼組","森組","戸田建設","熊谷組","青木あすなろ建設","北野建設","植木組","三井ホーム","名工建設",
                     "矢作建設工業","ピーエス三菱","日本ハウスホールディングス","大東建託","新日本建設","NIPPO","東亜道路工業","前田道路","日本道路","東亜建設工業","若築建設","東洋建設",
                     "徳倉建設","五洋建設","大林道路","金下建設","世紀東急工業","福田組","大成温調","テノックス","細田工務店","日本ドライケミカル","住友林業","日本基礎技術","日成ビルド工業",
                     "ヤマダ・エスバイエルホーム","巴コーポレーション","パナホーム","大和ハウス工業","ライト工業","積水ハウス","日特建設","北陸電気工事","日本電通","SYSKEN","ユアテック","TTK",
                     "シーキューブ","西部電気工業","日本リーテック","四電工","中電工","関電工","きんでん","東京エネシス","トーエネック","弘電社","住友電設","日本電設工業","協和エクシオ","新日本空調",
                     "日本工営","NDS","九電工","サンテック","三機工業","日揮","中外炉工業","テクノ菱和","高田工業所","ヤマト","太平電業","高砂熱学工業","中央ビルト工業","三晃金属工業","NECネッツエスアイ",
                     "朝日工業社","明星工業","大氣社","ダイダン","協和日成","日比谷総合設備","東芝プラントシステム","三信建設工業","ソルコム","北陸電話工事","神田通信機","高橋カーテンウォール工業",
                     "暁飯島工業","サイタホールディングス","日本製粉","日清製粉グループ本社","日東富士製粉","昭和産業","東福製粉","増田製粉所","鳥越製粉","中部飼料","日和産業","ヒガシマル","フィード・ワン",
                     "東洋精糖","日本甜菜製糖","三井製糖","塩水港精糖","フジ日本精糖","日新製糖","ネクスト","ミクシィ","インタースペース","ジェイエイシーリクルートメント","日本M＆Aセンター",
                     "メンバーズ","アコーディア・ゴルフ","燦キャピタルマネージメント","ヒップ","光ハイツ・ヴェラス","クルーズ","中広","やまねメディカル","データリンクス","UTグループ","アイティメディア",
                     "ケアネット","タケエイ","幼児活動研究会","E・Jホールディングス","トラスト・テック","セーラー広告","コシダカホールディングス","FRONTEO","フルスピード","ジーエヌアイグループ",
                     "日本マニュファクチャリングサービス","アルトナー","地域新聞社","パソナグループ","CDS","リンクアンドモチベーション","インサイト","博展","GCA","エス・エム・エス","イナリサーチ",
                     "トライステージ","成学社","サニーサイドアップ","テンプホールディングス","リニカル","シイエム・シイ","ソーバル","テラ","クックパッド","アミタホールディングス","エスクリ",
                     "アイ・ケイ・ケイ","森永製菓","中村屋","江崎グリコ","名糖産業","ブルボン","井村屋グループ","不二家","山崎製パン","第一屋製パン","カンロ","モロゾフ","日糧製パン","亀田製菓",
                     "岩塚製菓","寿スピリッツ","コモ","湖池屋","シベール","カルビー","森永乳業","六甲バター","ヤクルト本社","B-Rサーティワンアイスクリーム","明治ホールディングス","雪印メグミルク",
                     "プリマハム","日本ハム","林兼産業","丸大食品","福留ハム","S　Foods","滝沢ハム","柿安本店","伊藤ハム米久ホールディングス","きょくとう","学情","ドーン","CSSホールディングス",
                     "スタジオアリス","クロスキャット","シミックホールディングス","エプコ","SJI","システナ","ソフトフロントホールディングス","fonfun","NJS","デジタルアーツ","新日鉄住金ソリューションズ",
                     "東北新社","フォーサイド","綜合警備保障","クエスト","キューブシステム","いちご","ファステップス","極楽湯ホールディングス","アルバイトタイムス","トランスジェニック","平安レイサービス",
                     "アイスタディ","エヌアイデイ","ASJ","エイジア","日本駐車場開発","安川情報システム","コア","夢真ホールディングス","メディネット","カカクコム","アイロムグループ","ケア21",
                     "セントケア・ホールディング","スリープログループ","サイネックス","ルネサンス","ディップ","SBSホールディングス","総医研ホールディングス","ウェッジホールディングス","オプトホールディング",
                     "プラネット","日本ケアサプライ","新日本科学","DNAチップ研究所","ツクイ","アマナ","鉄人化計画","フジコー","アルテサロンホールディングス","KG情報","キャリアデザインセンター",
                     "ゲンダイエージェンシー","ベネフィット・ワン","エムスリー","ヒューマンホールディングス","ツヴァイ","ツカダ・グローバルホールディング","ブラス","ケアサービス","アウトソーシング",
                     "ウェルネット","ワールドホールディングス","ディー・エヌ・エー","博報堂DYホールディングス","シダー","共同ピーアール","シンワアートオークション","アスカネット","ぐるなび",
                     "エスアールジータカミヤ","プラップジャパン","ジャパンベストレスキューシステム","オールアバウト","夢テクノロジー","アウンコンサルティング","ファンコミュニケーションズ",
                     "ライク","ビジネス・ブレークスルー","バルクホールディングス","フュートレック","ヒビノ","エスプール","WDBホールディングス","比較.com","ジェイテック","システム・ロケーション",
                     "タウンニュース社","翻訳センター","夢の街創造委員会","ティア","CDG","日本サード・パーティ","アドウェイズ","バリューコマース","インフォマート","イーサポートリンク","ユナイテッド",
                     "ACKグループ","日本和装ホールディングス","サッポロホールディングス","アサヒグループホールディングス","キリンホールディングス","宝ホールディングス","オエノンホールディングス",
                     "ジャパン・フード＆リカー・アライアンス","養命酒製造","マルサンアイ","北海道コカ・コーラボトリング","コカ・コーラウエスト","コカ・コーライーストジャパン","フルッタフルッタ",
                     "サントリー食品インターナショナル","プレミアムウォーターホールディングス","ダイドードリンコ","伊藤園","キーコーヒー","ユニカフェ","ジャパンフーズ","日清オイリオグループ",
                     "不二製油グループ本社","ボーソー油脂","攝津製油","かどや製油","J-オイルミルズ","ローソン","まんだらけ","イオン九州","アスモ","マックスバリュ東北","ベクター","サンエー",
                     "カワチ薬品","オートウェーブ","イメージワン","タビオ","カネ美食品","エービーシー・マート","夢みつけ隊","ハードオフコーポレーション","ダイナック","高千穂交易","アスクル"]
        
        stockArray += anArray
        
        anArray = ["ゲオホールディングス","魚喜","アダストリア","ジーフット","シー・ヴイ・エス・ベイエリア","カワニシホールディングス","伊藤忠食品","YKT","ジー・テイスト","くらコーポレーション",
                   "キャンドゥ","木徳神糧","日本マクドナルドホールディングス","日本ライトン","大戸屋ホールディングス","ブロッコリー","久世","プラマテルズ","エレマテック","キタムラ","ジェイホールディングス",
                   "アイケイ","パルグループホールディングス","JALUX","エディオン","あらた","サーラコーポレーション","ワッツ","サダマツ","トーメンデバイス","ハローズ","ピクセルカンパニーズ",
                    "北雄ラッキー","JPホールディングス","石光商事","テンポスバスターズ","フジオフードシステム","あみやき亭","東葛ホールディングス","東京エレクトロンデバイス","トシン・グループ",
                   "三光マーケティングフーズ","エフティグループ","ひらまつ","フィールズ","双日","ヴィレッジヴァンガードコーポレーション","ゲンキー","ミューチュアル","クリムゾン","カッシーナ・イクスシー",
                   "パレモ","コメ兵","セリア","アルフレッサホールディングス","アップルインターナショナル","カルラ","ナフコ","大黒天物産","ハニーズ","日本プリメックス","ファーマライズホールディングス",
                   "ワイズテーブルコーポレーション","キッコーマン","味の素","ブルドックソース","ヱスビー食品","ユタカフーズ","キユーピー","ハウス食品グループ本社","カゴメ","焼津水産化学工業",
                   "和弘食品","佐藤食品工業","アリアケジャパン","ダイショー","ピエトロ","エバラ食品工業","やまみ","アヲハタ","はごろもフーズ","ニチレイ","セイヒョー","横浜冷凍","東洋水産",
                   "ジェーシー・コムサ","日東ベスト","イートアンド","大冷","ヨシムラ・フード・ホールディングス","日本食品化工","石井食品","日清食品ホールディングス","永谷園ホールディングス",
                   "石垣食品","太陽化学","シノブフーズ","一正蒲鉾","オーケー食品工業","あじかん","フジッコ","ロック・フィールド","旭松食品","日本たばこ産業","ケンコーマヨネーズ","仙波糖化工業",
                   "大森屋","わらべや日洋ホールディングス","マルタイ","なとり","サトウ食品工業","イフジ産業","ピックルスコーポレーション","篠崎屋","AFC-HDアムスライフサイエンス",
                   "RIZAPグループ","ファーマフーズ","北の達人コーポレーション","ユーグレナ","片倉工業","グンゼ","ヒューリック","神栄","価値開発","バナーズ","アプライド","パシフィックネット",
                   "山下医科器械","ラサ商事","クリエイト","アルペン","ハブ","ラクーン","ゴルフ・ドゥ","クオール","ケイティケイ","アルコニックス","神戸物産","ソリトンシステムズ","ビューティ花壇",
                   "セキュアヴェイル","カワサキ","ジェイアイエヌ","TRUCK-ONE","ビックカメラ","DCMホールディングス","ペッパーフードサービス","ハイパー","ほくやく・竹山ホールディングス",
                   "ゼットン","三洋堂ホールディングス","ヒラキ","ジェイグループホールディングス","MonotaRO","ライフフーズ","JBイレブン","東京一番フーズ","WDI","アスラポート・ダイニング",
                   "アマガサ","ストリーム","ダイヤモンドダイニング","銚子丸","あいホールディングス","ホリイフードサービス","ディーブイエックス","ジェーソン","きちり","シーズメン",
                   "アークランドサービスホールディングス","J.フロントリテイリング","ドトール・日レスホールディングス","マツモトキヨシホールディングス","テクノアルファ","ブロンコビリー",
                   "スタートトゥデイ","トレジャー・ファクトリー","スーパーバリュー","オーシャンシステム","物語コーポレーション","ココカラファイン","三越伊勢丹ホールディングス","東洋紡",
                   "ユニチカ","富士紡ホールディングス","日清紡ホールディングス","倉敷紡績","ダイワボウホールディングス","シキボウ","日東紡績","オーミケンシ","Oakキャピタル","トヨタ紡織",
                   "マーチャント・バンカーズ","サイボー","新内外綿","シンデン・ハイテックス","マクニカ・富士エレホールディングス","海帆","Hamee","マーケットエンタープライズ","エコノス","ファンデリー",
                   "富士山マガジンサービス","ラクト・ジャパン","イデアインターナショナル","ウエルシアホールディングス","オーウイル","クリエイトSDホールディングス","グリムス","バイタルケーエスケー・ホールディングス",
                   "八洲電機","メディアスホールディングス","UKCホールディングス","ジューテックホールディングス","丸善CHIホールディングス","大光","アゼアス","フーマイスターエレクトロニクス",
                   "OCHIホールディングス","TOKAIホールディングス","黒谷","ミサワ","マックスバリュ九州","ティーライフ","大阪工機","ハピネス・アンド・ディ","エー・ピーカンパニー","三洋貿易",
                   "ありがとうサービス","チムニー","シュッピン","ビューティガレージ","買取王国","オイシックス","ウイン・パートナーズ","ICDAホールディングス","夢展望","ネクステージ","サンワカンパニー",
                   "ANAP","ホットマン","ジョイフル本田","白鳩","鳥貴族","キリン堂ホールディングス","ジェネレーションパス","ホットランド","すかいらーく","SFPダイニング","綿半ホールディングス",
                   "日本毛織","ダイトウボウ","トーア紡コーポレーション","ダイドーリミテッド","カネヨウ","ヨシックス","ユナイテッド・スーパーマーケット・ホールディングス","エスエルディー",
                   "ゼネラル・オイスター","三栄建築設計","スター・マイカ","野村不動産ホールディングス","三重交通グループホールディングス","プロパスト","イントランス","セントラル総合開発",
                   "ウィル","アーバネットコーポレーション","サムティ","ディア・ライフ","コーセーアールイー","アールエイジ","エー・ディー・ワークス","日本商業開発","プレサンスコーポレーション",
                   "ユニゾホールディングス","エスポア","グランディーズ","アスコット","ファンドクリエーショングループ","フィル・カンパニー","THEグローバル社","ハウスコム","日本管理センター",
                   "サンセイランディック","エストラスト","フージャースホールディングス","トラストホールディングス","オープンハウス","東急不動産ホールディングス","飯田グループホールディングス",
                   "アズマハウス","イーグランド","東武住販","ムゲンエステート","AMBITION","帝国繊維","日本製麻","ブックオフコーポレーション","日本コークス工業","東京日産コンピュータシステム",
                   "フライングガーデン","メガネスーパー","ゴルフダイジェスト・オンライン","クロスプラス","ミタチ産業","アルファグループ","レカム","ランシステム","BEENOS","東和フードサービス",
                   "あさひ","日本調剤","ワンダーコーポレーション","21LADY","トラスト","コスモス薬品","レッド・プラネット・ジャパン","バッファロー","メディカル一光","クリヤマホールディングス",
                   "テリロジー","ワイエスフード","タイセイ","シップヘルスケアホールディングス","トーエル","一六堂","フジタコーポレーション","ソフトクリエイトホールディングス","関門海","内外テック",
                    "ZOA","オンリー","バイク王＆カンパニー","セブン＆アイ・ホールディングス","アークコア","薬王堂","コスモ・バイオ","クリエイト・レストランツ・ホールディングス","明治電機工業",
                   "INEST","ツルハホールディングス","デリカフーズ","スターティア","サンマルクホールディングス","フェリシモ","トリドールホールディングス","丸千代山岡家","帝人","東レ","クラレ",
                   "旭化成","サカイオーベックス","北日本紡績","TOKYO_BASE","ピクスタ","大木ヘルスケアホールディングス","バルニバービ","アートグリーン","ケー・エフ・シー","稲葉製作所",
                   "丸順","エスイー","ミヤコ","アトムリビンテック","宮地エンジニアリンググループ","トーカロ","アルファ","サンコーテクノ","SUMCO","特殊電極","三ツ知","日創プロニティ",
                   "山王","MIEコーポレーション","川田テクノロジーズ","菊池製作所","RSTechnologies","ビーロット","ファーストブラザーズ","ハウスドゥ","シーアールイー","パルマ","プロパティエージェント",
                   "ケイアイスター不動産","アグレ都市デザイン","デュアルタップ","G-FACTORY","グッドコムアセット","フォーライフ","住江織物","丸八ホールディングス","日本フエルト","イチカワ","フジコー",
                   "エコナックホールディングス","日東製網","芦森工業","プロスペクト","アツギ","アクサスホールディングス","昭栄薬品","ウイルプラスホールディングス","ジャパンミート","農業総合研究所",
                   "ベガコーポレーション","コメダホールディングス","サツドラホールディングス","デファクトスタンダード","ダイユー・リックホールディングス","串カツ田中","バロックジャパンリミテッド",
                   "クスリのアオキホールディングス","スタジオアタオ","ダイニック","共和レザー","リネットジャパングループ","セーレン","ソトー","東海染工","倉庫精練","小松精練","オーベクス",
                   "ワコールホールディングス","ホギメディカル","自重堂","山喜","フジックス","川本産業","レナウン","クラウディア","TSIホールディングス","ネットイヤーグループ","ビリングシステム",
                   "アクセルマーク","テックファームホールディングス","TIS","ネオス","データホライゾン","電算システム","グリー","GMOペパボ","ソケッツ","コーエーテクモホールディングス",
                   "三菱総合研究所","ボルテージ","電算","パピレス","メディカルネット","駅探","ジー・スリーホールディングス","AGS","ファインデックス","ディジタルメディアプロフェッショナル",
                   "モルフォ","ヒト・コミュニケーションズ","ブレインパッド","KLab","ポールトゥウィン・ピットクルーホールディングス","イーブックイニシアティブジャパン","ネクソン","アイスタイル",
                   "エムアップ","エイチーム","アートスパークホールディングス","モブキャスト","エニグモ","テクノスジャパン","enish","コロプラ","モバイルクリエイト","協立情報通信","ソフトマックス",
                   "オルトプラス","ブロードリーフ","オークファン","クロス・マーケティンググループ","ハーツユナイテッドグループ","システム情報","メディアドゥ","じげん","ホットリンク","ブイキューブ",
                   "エンカレッジ・テクノロジ","サイバーリンクス","みんなのウェディング","ディー・エル・イー","フィックスターズ","VOYAGEグループ","イグニス","ロックオン","リアルワールド",
                   "FFRI","オプティム","GMOリサーチ","セレス","SHIFT","CRI・ミドルウェア","特種東海製紙","ジョルダン","創通","情報企画","ジェクシード","日本ファルコム","ベリサーブ",
                   "フォーシーズホールディングス","アプリックスIPホールディングス","ソフトウェア・サービス","インテア・ホールディングス","ティーガイア","コムシード","セック","ITbook","サイオステクノロジー",
                   "インタートレード","セブンシーズホールディングス","日本アジアグループ","フライトホールディングス","エキサイト","豆蔵ホールディングス","アエリア","ケイブ","テクマトリックス",
                   "プロシップ","ガンホー・オンライン・エンターテイメント","システムズ・デザイン","リスクモンスター","GMOペイメントゲートウェイ","ザッパラス","システムリサーチ","ウェルス・マネジメント",
                   "アドバンスト・メディア","インターネットイニシアティブ","ガイアックス","ブロードバンドタワー","ジオネクスト","さくらインターネット","ジェイ・エスコムホールディングス",
                   "ディー・ディー・エス","ヴィンクス","テクノマセマティカル","GMOクラウド","IGポート","ドリコム","エヌ・デーソフトウェア","いい生活","ULSグループ","キーウェアソリューションズ",
                   "ユニリタ","エコミック","イメージ情報開発","システムディ","フィスコ","オウケイウェイヴ","サイバーステップ","アルファクス・フード・システム","メディア工房","大和コンピューター",
                   "SRAホールディングス","Minoriソリューションズ","アクロディア","メディアファイブ","リミックスポイント","システムインテグレータ","ギガプライズ","T＆Cメディカルサイエンス",
                   "朝日ネット","eBASE","アバント","アドソル日進","ODKソリューションズ","パス","ジーダット","ネクストジェン","フリービット","コムチュア","アイフリークモバイル","パシフィックシステム",
                   "データ・アプリケーション","日本テクノ・ラボ","エヌ・ティ・ティ・データ・イントラマート","日本一ソフトウェア","サイバーコム","インフォテリア","アイル","リアルコム",
                   "ラック","ユビキタス","王子ホールディングス","日本製紙","三菱製紙","北越紀州製紙","中越パルプ工業","巴川製紙所","大王製紙","ニッポン高度紙工業","岡山製紙","ハビックス",
                   "阿波製紙","クラウドワークス","マークラインズ","メディカル・データ・ビジョン","gumi","カヤック","データセクション","ALBERT","シリコンスタジオ","コラボス","ショーケース・ティービー",
                   "エムケイシステム","Aiming","モバイルファクトリー","sMedio","JIG-SAW","テラスカイ","デジタル・インフォメーション・テクノロジー","アイリッジ","PCIホールディングス",
                   "パイプドHD","アイビーシー","ネオジャパン","PR_TIMES","ラクス","ランドコンピュータ","ダブルスタンダード","オープンドア","アークン","マイネット","ソーシャルワイヤー",
                   "はてな","バリューゴルフ","アカツキ",]
        
        return stockArray;
    }

}
